def linear_congruential_generator(m: int, a: int, c: int, seed: int):
    """
    Генератор псевдослучайных чисел с использованием линейного конгруэнтного метода.

    :param m: Модуль (диапазон значений).
    :param a: Множитель.
    :param c: Приращение.
    :param seed: Начальное значение (seed).

    :yield: Следующее псевдослучайное число.
    """
    x = seed
    while True:
        yield x
        x = (a*x + c) % m

#Рекомендлванные параметры для инициализации генератора:
# m = [2**32, 2**32, 2**31, 2**31, 2**32, 2**32, 2**32, 2**32, 2**24, 2**31 - 1, 2**31 - 1, 2**31 - 1, 2**31 - 1, 2**64, 2**64, 69069, 2**48]
# a = [1664525, 226954477, 1103515245, 1103515245, 1103515245, 1103515245, 134775813, 214013, 1140671485, 2147483629, 16807, 48271, 6364136223846793005, 6364136223846793005, 69069, 25214903917]
# c = [1013904223, 1, 12345, 12345, 12345, 12345, 1, 2531011, 12820163, 2147483587, 0, 0, 1442695040888963407, 1, 11]
#Генератор Лемера: c = 0